#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Перем ДвижениеРегистра;
	Перем ДвижениеПродаж;

	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	// регистр ПродажиТоваров Обороты
	Движения.ПродажиТоваров.Записывать = Истина;

	Для Каждого ТекущаяСтрокаТовары Из Товары Цикл
		ДвижениеРегистра = Движения.ОстаткиТоваров.Добавить();
		ДвижениеРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеРегистра.Период = Дата;
		ДвижениеРегистра.Товар = ТекущаяСтрокаТовары.Товар;
		ДвижениеРегистра.Количество = ТекущаяСтрокаТовары.Количество;

		ДвижениеПродаж = Движения.ПродажиТоваров.Добавить();
		ДвижениеПродаж.Период = Дата;
		ДвижениеПродаж.Товар = ТекущаяСтрокаТовары.Товар;
		ДвижениеПродаж.Контрагент = Контрагент;
		ДвижениеПродаж.Количество = ТекущаяСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти