#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Перем ДвижениеРегистра;

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекущаяСтрокаТовары Из Товары Цикл
		ДвижениеРегистра = Движения.ОстаткиТоваров.Добавить();
		ДвижениеРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеРегистра.Период = Дата;
		ДвижениеРегистра.Товар = ТекущаяСтрокаТовары.Товар;
		ДвижениеРегистра.Количество = ТекущаяСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
