
#Область ОбработчикиКоманд

&НаКлиенте
Процедура Печать(Команда)

	ТабличныйДокумент = ПечатьРеализацииНаСервере();
	ТабличныйДокумент.Показать("Реализация");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПечатьРеализацииНаСервере()

	Перем ИтогоКоличество;

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Макет = Документы.Реализация.ПолучитьМакет("ПечатьРеализации");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Номер = ДокументОбъект.Номер;
	ОбластьШапка.Параметры.Дата = Формат(ДокументОбъект.Дата, "ДЛФ=D");
	ОбластьШапка.Параметры.Контрагент = ДокументОбъект.Контрагент;
	ТабличныйДокумент.Вывести(ОбластьШапка);

	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));

	ИтогоКоличество = 0;
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	Для Каждого ТекущаяСтрокаТовары Из ДокументОбъект.Товары Цикл
		ОбластьСтрока.Параметры.НомерСтроки = ТекущаяСтрокаТовары.НомерСтроки;
		ОбластьСтрока.Параметры.Товар = ТекущаяСтрокаТовары.Товар;
		ОбластьСтрока.Параметры.Количество = ТекущаяСтрокаТовары.Количество;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		ИтогоКоличество = ИтогоКоличество + ТекущаяСтрокаТовары.Количество;
	КонецЦикла;

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ИтогоКоличество = ИтогоКоличество;
	ТабличныйДокумент.Вывести(ОбластьПодвал);

	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти